[32m
[32m***********************************************************************************************
[32mYou need to connect to the database to continue
[32mDBMS:
[32m	-fb FireBird (DB_Name = full_path\DB_Name.fdb)
[32m	-ms MS SQL Server
[32m	-pg PostgreSQL
[32mFor connect to DB please enter: connect -DBMS -DB_Server[:port] [-DB_Name] -user -password
[32m***********************************************************************************************
[32m
> The connection to the server has been established!
[32mEnter the command or 'help' for help.
PostgreSQL> [31mWrong table name.
[32m
[32mEnter the command or 'help' for help.
PostgreSQL> [31mInvalid number of parameters. Expected 1, but got 2
[32mEnter the command or 'help' for help.
PostgreSQL> [32m***********************************************************************************************
[32mEnter a new column of table: field name|field type|if the field is primary(y/n)|if is NULL (y/n)
[32mend
[32mFor example:
[32mnew_Field1|integer|y|n
[32mnew_Field2|varchar(20)|n|n
[32mnew_Field3|varchar(10)|n|y
[32mend
[32m***********************************************************************************************
[32m
PostgreSQL> PostgreSQL> [31mField name new_field1 already typed
[32m
PostgreSQL> PostgreSQL> [32mTable with name "new_tab" is created successfully.
[32mEnter the command or 'help' for help.
PostgreSQL> [31mTable is already exist.
[32m
[32mEnter the command or 'help' for help.
PostgreSQL> [31mTable is not exist.
[32m
[32mEnter the command or 'help' for help.
PostgreSQL> [32m***********************************************************************************************
Table new_tab[32m has following columns
|new_field1|new_field2|[32m
[32mEnter a new row of table:
[32mrow1=value1|row2=value2|...|rowN=valueN
[32m***********************************************************************************************
[32m
PostgreSQL> The command completed successfully!
[32mEnter the command or 'help' for help.
PostgreSQL> [32m***********************************************************************************************
Table new_tab[32m has following columns
|new_field1|new_field2|[32m
[32mEnter a new row of table:
[32mrow1=value1|row2=value2|...|rowN=valueN
[32m***********************************************************************************************
[32m
PostgreSQL> The command completed successfully!
[32mEnter the command or 'help' for help.
PostgreSQL> [32m***********************************************************************************************
Table new_tab[32m has following columns
|new_field1|new_field2|[32m
[32mEnter a new row of table:
[32mrow1=value1|row2=value2|...|rowN=valueN
[32m***********************************************************************************************
[32m
PostgreSQL> The command completed successfully!
[32mEnter the command or 'help' for help.
PostgreSQL> ___________________________________________[32m
|          new_field1|          new_field2[32m|
===========================================[32m
|                   1|                  20|[32m
|                   2|                  40|[32m
|                   3|                  60|[32m
-------------------------------------------
[32mEnter the command or 'help' for help.
PostgreSQL> ___________________________________________[32m
|          new_field1|          new_field2[32m|
===========================================[32m
|                   2|                  40|[32m
|                   3|                  60|[32m
-------------------------------------------
[32mEnter the command or 'help' for help.
PostgreSQL> [31mInvalid number of parameters. Expected from 1 to 3, but got 4
[32mEnter the command or 'help' for help.
PostgreSQL> _______________________________________________________________[32m
|                    TABLE NAME|                     ROW COUNT[32m|
===============================================================[32m
|                       new_tab|                             3|
---------------------------------------------------------------
[32mEnter the command or 'help' for help.
PostgreSQL> ___________________________________________[32m
|          new_field1|          new_field2[32m|
===========================================[32m
|          new_field1|          new_field2|[32m
|                   1|                  20|[32m
|                   2|                  40|[32m
|                   3|                  60|[32m
-------------------------------------------
[32mEnter the command or 'help' for help.
PostgreSQL> The command completed successfully!
[32mEnter the command or 'help' for help.
PostgreSQL> [31mTable is not exist.
[32m
[32mEnter the command or 'help' for help.
PostgreSQL> [32m***********************************************************************************************
[32mTable new_tab has following columns
|new_field1|new_field2|[32m
[32mEnter a condition for update row of table:
[32mcolumnName=newValue|columnName=Value
[32m***********************************************************************************************
[32m
PostgreSQL> The command completed successfully!
[32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> [31mTable is not exist.
[32m
[32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> [32m***********************************************************************************************
[32mTable new_tab has following columns
|new_field1|new_field2|[32m
[32mEnter a condition for delete row of table:
[32mcolumnName=value
[32m***********************************************************************************************
[32m
PostgreSQL> The command completed successfully!
[32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> [32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> The command completed successfully!
[32mTable "new_tab" is empty
[32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> [32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> [32mDeleting table canceled.
[32mEnter the command or 'help' for help.
PostgreSQL> [31mAre you sure? (y/n)
PostgreSQL> [32mTable with name "new_tab" is deleted successfully
[32mEnter the command or 'help' for help.
PostgreSQL> The work is completed